benchmarks/testing/llama-2-7b/_2__1000/log_11829635.out
WARNING 11-15 16:59:51 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=10835, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_mean.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1000, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, profile=False, save_result=True, metadata=None, result_dir='benchmarks/testing/llama-2-7b/_2__1000', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--port=10835 --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b --max-num-seqs=2', launch_server_with_nsight=False, disable_log_stats=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Server started
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     1000      
Benchmark duration (s):                  1303.58   
Total input tokens:                      250000    
Total generated tokens:                  231000    
Request throughput (req/s):              0.77      
Output token throughput (tok/s):         177.20    
Total Token throughput (tok/s):          368.99    
---------------Time to First Token----------------
Mean TTFT (ms):                          650735.36 
Median TTFT (ms):                        650681.15 
P99 TTFT (ms):                           1287907.99
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.21     
Median TPOT (ms):                        11.19     
P99 TPOT (ms):                           11.25     
---------------Inter-token Latency----------------
Mean ITL (ms):                           11.25     
Median ITL (ms):                         11.25     
P99 ITL (ms):                            11.80     
==================================================
Concurrent checker terminated
Server terminated